<?php

namespace Database\Seeders;

use App\Models\Document;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class DocumentSeeder extends Seeder
{
    public function run()
    {
        $documents = [
            ['name' => 'بطاقة إرشادات : يتم سحبها من مقر الإدارة الجهوية للحماية المدنية'],
            ['name' => 'نسخة من بطاقة التعريف الوطنية  لطالب الشهادة (إذا كان شخصًا طبيعيًا) أو للممثل القانوني (إذا كان شخصًا معنويًا)'],
            ['name' => ' إشهار قانوني مضمون من الإشهار القانوني بالرائد الرسمي للجمهورية التونسية بالنسبة لتأسيس الشخص المعنوي '],
            ['name' => ' وثيقة تثبت تصرف الطالب في البناية ما يثبت وجه تصرف الطالب في البناية '],
            ['name' => 'رسم بياني لموقع البناية  رسم بياني لموقع ومداخل وأجزاء البناية أو ما يقوم مقامه'],
            ['name' => ' وصل خالص الإتاوة وصل خالص الإتاوة المستوجبة طبقًا للنموذج المرفق بالقرار'],
            ['name' => 'وثيقة خاصة بالبنايات المعدة للسكن بالنسبة للبنايات المعدة للسكن من النوعين الثالث والرابع '],
            ['name' => ' نسخة من قرار الترخيص بالنسبة للبنايات المحتوية على مؤسسات خطرة أو مخلة بالصحة أو مزعجة '],
        ];
        
        foreach ($documents as $document) {
            Document::create($document);
        }
    }
}